{
  "personalInformation": {
    "nationality": "Brazilian",
    "address": "Canoas, Rio Grande do Sul",
    "phoneNumber": "(51) 99988-8483",
    "email": "maxjonas2@hotmail.com"
  },
  "profileDescription": "Dedicated, self-motivated developer and civil servant looking to make a permanent transition into software engineering. I have a considerable amount of knowledge in a variety of web technologies, which I have been using, practicing, and perfecting for the last decade. As a fast and resourceful learner, I can easily pick up and make use of new knowledge. I am a communicative challenge-seeker passionate about people with a strong growth mindset who I can both help and learn from. I have built the mobile app for a large e-commerce platform (Estrela 10) and am currently working on personal web and mobile application projects using React.js, Next.js, React Native, Node.js, Google Cloud and machine learning integration, among others.",
  "jobs": [
    {
      "title": "Administrative Assistant",
      "place": "Receita Federal do Brasil",
      "duties": "Finance and budget control",
      "period": "Feb 2015 - Present"
    },
    {
      "title": "Customer Service Clerk",
      "place": "Banco do Brasil",
      "duties": "Sales and customer service",
      "period": "Feb 2012 - Jun 2013"
    },
    {
      "title": "Warehouse Clerk",
      "place": "OrthoSource do Brasil",
      "duties": "Assistance in various warehouse duties",
      "period": "Aug 2011 - Dec 2011"
    }
  ],
  "education": [
    {
      "degreeTitle": "Tecnólogo em Análise e Desenvolvimento de Sistemas",
      "institutionName": "Universidade do Vale do Rio dos Sinos",
      "period": "2023/01 - In Progress"
    },
    {
      "degreeTitle": "Tecnólogo em Gestão Financeira",
      "institutionName": "Universidade do Vale do Rio dos Sinos",
      "period": "Finished 2022/02"
    },

    {
      "degreeTitle": "Técnico em Informática",
      "institutionName": "Instituto Pró-Universidade Canoense",
      "period": "Finished 2010/02"
    }
  ],
  "skills": [
    {
      "label": "HTML/CSS",
      "description": "I understand HTML fundamentals, document structure, metadata, the proper usage of semantic markup and page structure elements in conformity to W3C specifications, as well as attributes and their correct implementation. I can easily implement user input features such as forms and input elements, as well as audiovisual elements (e.g. *<audio>* and *<video>*) and device-specific visual optimization (e.g. *<picture>* and *<source>* tags). I have an extensive knowledge of CSS, from fundamentals such as the box model, layout flow, common element properties, positioning, the cascade, size units, CSS custom properties, pseudo-classes and specificity rules to more advanced concepts such as Flexbox, Grid, 3D transforms, transitions and animations, clipping and masking, advanced selectors, pseudo-elements and cross-browser compatibility. I am familiar with and able to effectively implement responsive web design and media queries.",
      "level": 9
    },
    {
      "label": "Javascript (ES6) / Front-end Development",
      "description": "I have a solid understanding of fundamental programming concepts, with a major focus on JavaScript, from essentials such as variables, arrays, objects, types, functions, callbacks, scope, iteration, recursion, conditional statements, and events, to more advanced topics such as classes and object-oriented programming, promises and promise-based APIs, asynchronous functions, the event loop, throttling and debouncing, hoisting, closures, object prototypes, prototype inheritance and more advanced array manipulation methods. I understand and can easily utilize features such as destructuring, spread syntax, template literals, arrow functions, Maps and Sets and modules. I am familiar with the Document Object Model, DOM manipulation, and modern browser APIs such as Fetch, XMLHttpRequest, WebWorkers, Geolocation, Storage, Broadcast Channel, Web Animations, Canvas, and WebSockets. Additionally, I have a solid grasp of TypeScript and its main features and am acquainted with Node.js and package management via NPM.",
      "level": 9
    },
    {
      "label": "React.js",
      "description": "I have a comprehensive understanding of all core React concepts, such as components, props, component-based application development, component modularity, reusability, and state management. I understand and can make use of built-in React hooks in functional components, such as *useState*, *useEffect*, *useRef* and *useReducer*, as well as implement custom hooks for specific or common tasks. I have a full understanding of the concept and usage of props, state lifting, child-to-parent communication, as well as the Context API for reducing or eliminating excessive prop-drilling. I can implement performance optimization techniques, such as memoization (*React.memo*, *useCallback*, *useMemo* etc.) and code-splitting. Additionally, I can implement client-side routing using declarative routing libraries such as React Router and make use of its principal tools, such as URL-based rendering, nesting, URL parameters, and navigation. I also have an essential understanding of bundling tools such as Webpack. ",
      "level": 8
    },
    {
      "label": "React Native / Mobile Development",
      "description": "I am acquainted with React Native concepts, fundamental mobile app development notions, React Native core components and libraries (*View*, *Text*, *Image*, *ScrollView*, *FlatList*, *SectionList*, *Touchable*, *Pressable*, *Animated* etc.) as well as external libraries for added layout functionality and navigation (e.g. React Navigation). I am able to incorporate all fundamental and necessary core React concepts into React Native.",
      "level": 8
    },
    {
      "label": "Next.js",
      "description": "I understand and can utilize Next.js as a React-based framework for Server-Side Rendering of web applications and Static Site Generation for enhanced page performance, as well as Incremental Static Regeneration and CDN caching, SEO optimization, etc. I can create a Next.js project and implement most Next-specific features, such as folder-based routing, dynamic routes, React Server and Client Components, nested layouts, page pre-rendering, image optimization and automatic prefetching of pages for faster navigation. I can deploy Next.js apps using platforms such as Vercel and AWS.",
      "level": 8
    },
    {
      "label": "Git",
      "description": "I have a working grasp of versioning concepts and can use Git for cloning and initializing repositories, staging and committing code changes, pushing and pulling changes to and from remote repositories such as GitHub, branching and merging, reverting to previous commits as well as essential configuration.",
      "level": 7
    },
    {
      "label": "Web Design",
      "description": "I can effectively use tools such as Figma and Adobe Photoshop for prototyping user interfaces and crafting external visual elements when necessary. I also have a decent understanding of fundamental design principles, typography, design systems, color theory and UI / UX patterns for providing the user with a fluid, intuitive, visually pleasing and responsive experience, including accessibility concerns.",
      "level": 7
    },
    {
      "label": "Back-end development / Cloud Computing",
      "description": "I am able to set up and develop a back-end server using Node.js for handling essential routing, REST API creation and consumption, HTTP requests and responses, form input validation and manipulation, database integration, file handling and serving, HTML pre-processing etc. I am familiar with frameworks such as Express.js and the core aspects of HTTP. I can use cloud platforms such as Google Cloud and AWS to set up virtual machines, serverless functions (e.g. AWS Lambda), storage and Docker containers.",
      "level": 6
    }
  ]
}
